% Вариант 11

function main()
    X = [-2.54,-0.79,-4.27,-3.09,-3.82,-0.61,-0.64,-1.24,-1.73,-2.91,-1.48,-1.28,-0.37,-1.88,-2.19,-1.61,-1.52,-3.17,-1.36,-3.08,-3.11,-3.07,-1.57,-1.51,-2.37,-0.58,-3.05,-2.93,-1.01,-1.40,-2.06,-3.05,-1.84,-1.24,-1.89,-2.06,-1.59,-2.83,-1.07,-2.96,-3.17,-3.08,-0.49,-3.11,-3.14,-2.30,-3.99,-1.56,-1.28,-3.46,-2.63,-0.82,-2.18,-0.89,-3.08,-1.13,-1.62,-1.06,-2.98,-1.55,-1.49,-1.65,-1.45,-2.29,-0.85,-1.44,-2.87,-2.40,-2.13,-3.52,-1.42,-3.64,-3.47,-2.05,-2.39,-2.07,-0.80,-1.52,-3.92,-2.22,-0.78,-2.60,-1.78,-1.61,-1.65,-2.06,-3.33,-3.41,-1.97,-1.74,-2.04,0.01,-1.37,-3.15,-2.35,-3.66,-1.79,-2.56,-1.87,-1.06,-0.64,-2.49,-1.85,-1.40,-0.86,-0.17,-0.62,-2.85,-2.12,-1.17,-2.48,-1.65,-3.74,-2.87,-3.15,-1.89,-1.34,-4.33,-0.96,-1.79];

    % а) Максимальное и минимальное значения
    M_max = max(X);
    M_min = min(X);
    
    fprintf("\nа) M_max = %f; M_min = %f\n", M_max, M_min);
    
    % б) Размах
    R = M_max - M_min;
    
    fprintf("б) R = %f\n", R);
    
    % в) Оценка мат. ожидания 
    mu = sum(X) / length(X);
    
    % Несмещенная оценка дисперсии
    s2 = sum((X - mu).^ 2) / (length(X) - 1);
    
    fprintf("в) mu = %f; S^2 = %f\n", mu, s2);
    
    % г) Группировка значений выборки

    % Нахождение количества интервалов
    m = floor(log2(length(X))) + 2;
    
    fprintf("г) m = %f\n", m);
    

    % Группировка значений в m интервалов       
    delta = R / m;
    edges = zeros(1, m + 1);
    counts = zeros(1, m + 1);

    % Указываем границы интервалов
    for i = 1:m + 1
        edges(i) = M_min + delta * (i - 1);
    end
    
    for i = 1:length(X)
        for j = 1:m
            if X(i) >= edges(j) && X(i) < edges(j+1)
                counts(j) = counts(j) + 1;
                break;
            end
        end
    end
    counts(m) = counts(m) + 1;
    
    % Вывод всех интервалов и количества элементов
    for i = 1:m - 1
        fprintf("[ %f ; %f ) - %d\n", edges(i), edges(i + 1), counts(i));
    end
    fprintf("[ %f ; %f ] - %d\n\n\n", edges(m), edges(m + 1), counts(m));
    
    % д) Построение гистограммы
    for i = 1:m + 1
        counts(i) = counts(i) / (length(X) * delta);
    end

    stairs([edges(1), edges], [0 counts], 'LineWidth', 2);

    % Построение на одной координатной плоскости
    grid on;
    hold on;

    Xn = M_min : delta / 20 : M_max;
    sigma = sqrt(s2);

    % График функции плотности распределения вероятностей нормальной случайной величины
    Y = normpdf(Xn, mu, sigma);
    plot(Xn, Y, 'LineWidth', 2);
    legend('Гистограмма', 'Ф-я плотности распрделения нсв', 'Location', 'northwest');
    
    % е) 
    % Новая координатная плоскость
    figure;
    
    % Построение графика эмпрической функции распределения
    [YY, XX] = ecdf(X);  
    stairs(XX, YY);
    hold on;
    
    % Построение графика функции распределения нормальной случайной величины
    Y = normcdf(Xn, mu, sigma);
    plot(Xn, Y, 'black');
    
    legend('Эмпирическая функция распределения', 'Функция распределения', 'Location', 'northwest')
end

